In [1]:
import numpy as np
import matplotlib.pyplot as plt
%matplotlib inline
import pandas as pd

In [13]:
ds = pd.read_csv('./titanic.csv')
print ds.columns

ds.head()

Index([u'PassengerId', u'Survived', u'Pclass', u'Name', u'Sex', u'Age',
       u'SibSp', u'Parch', u'Ticket', u'Fare', u'Cabin', u'Embarked'],
      dtype='object')

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

In [22]:
cols_to_drop = ['PassengerId','Name','Ticket','Embarked','Cabin']
df = ds.drop(cols_to_drop, axis=1)

print df.columns
df.head()

Index([u'Survived', u'Pclass', u'Sex', u'Age', u'SibSp', u'Parch', u'Fare'], dtype='object')

   Survived  Pclass     Sex   Age  SibSp  Parch     Fare
0         0       3    male  22.0      1      0   7.2500
1         1       1  female  38.0      1      0  71.2833
2         1       3  female  26.0      0      0   7.9250
3         1       1  female  35.0      1      0  53.1000
4         0       3    male  35.0      0      0   8.0500

In [23]:
df = df.dropna(axis=0)
print df.values.shape

(714, 7)

In [24]:
sex_mapping = {
    'male' : 0,
    'female': 1,
}
df.Sex = df.Sex.map(sex_mapping)

df.head()

   Survived  Pclass  Sex   Age  SibSp  Parch     Fare
0         0       3    0  22.0      1      0   7.2500
1         1       1    1  38.0      1      0  71.2833
2         1       3    1  26.0      0      0   7.9250
3         1       1    1  35.0      1      0  53.1000
4         0       3    0  35.0      0      0   8.0500

In [25]:
data = df.values

## Split into Test and Training
split = int(0.80*data.shape[0])

X_train = data[:split,1:]
X_test = data[split:, 1:]

Y_train = data[:split, 0]
Y_test = data[split:, 0]

print X_train.shape
print X_test.shape

print Y_train.shape
print Y_test.shape

(571, 6)
(143, 6)
(571,)
(143,)

In [27]:
from sklearn.tree import DecisionTreeClassifier
from sklearn.ensemble import RandomForestClassifier

In [51]:
dt = DecisionTreeClassifier(criterion='entropy')
dt.fit(X_train, Y_train)
print 100*dt.score(X_train, Y_train)
print 100*dt.score(X_test, Y_test)

98.4238178634
78.3216783217

In [52]:
rf = RandomForestClassifier(criterion='entropy')
rf.fit(X_train, Y_train)
print 100*rf.score(X_train, Y_train)
print 100*rf.score(X_test, Y_test)

97.1978984238
84.6153846154